OpenFOAM-v1812/tutorials/combustion/reactingFoam/RAS/chockedNozzle/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    location        "constant";
    object          chemistryProperties;
}

chemistryType
{
    chemistrySolver   ode;
    chemistryThermo   psi;
    TDAC              off;
}

initialChemicalTimeStep 1e-07;

chemistry       off;

odeCoeffs
{
    solver          Rosenbrock34;  // Rosenbrock34, seulex or rodas23
    absTol          1e-12;
    relTol          1e-7;
}

// ************************************************************************* //
